# Список параметров для передачи полному сценарию проверки "Заказать"
field_input = 'button_order, name, surname, address, metro, phone, date, period, colour_scooter, comment'

# Список значений параметров для передачи полному сценарию проверки "Заказать"
nabor = [('top_button', 'Александр', 'Ягодкин', 'Пархоминку 73', 'Фрунзуенская', '+79174005566', '15.08.2023', 'двое суток',
          'чёрный жемчуг', 'Хочу быстрее'),
         ('down_button', 'Алина', 'Малинкина', 'Менделеева 156', 'Сокольники', '+79378473433', '5.08.2023', 'трое суток',
          'серая безысходность', 'Заранее позвонить')]

# Список параметров для проверки формы №1
field_input_from_1 = 'button_order, name, surname, address, metro, phone'

# Список параметров для проверки формы №2
field_input_from_2 = 'date, period, colour_scooter, comment'

# Список значений параметров для проверки формы №1
value_input_form_1 = [('top_button', 'Александр', 'Ягодкин', 'Пархоминку 73', 'Фрунзуенская', '+79174005566'),
                      ('down_button', 'Алина', 'Малинкина', 'Менделеева 156', 'Сокольники', '+79378473433')]

# Список значений параметров для проверки формы №1
value_input_form_2 = [('15.08.2023', 'двое суток', 'чёрный жемчуг', 'Хочу быстрее'),
                      ('5.08.2023', 'трое суток', 'серая безысходность', 'Заранее позвонить')]

# # Список значений параметров для проверки верхней и нижней кнопки "Заказать"
button_ord = ['top_button', 'down_button']